{"pages":[{"text":"About COMPRES COMPRES , the Consortium for Materials Properties Research in Earth Sciences is a community-based consortium whose goal is to enable Earth Science researchers to conduct the next generation of high-pressure science on world-class equipment and facilities. It facilitates the operation of beam lines, the development of new technologies for high pressure research, and advocates for science and educational programs to the various funding agencies. About COMPTECH The mission of COMPRES is driven by its science goals, but it is mainly the experimental technology available at central facilities such as synchrotron beamlines, that enables this science. Argonne National Laboratory's synchrotron source, the Advanced Photon Source (APS) is currently the leading central facility for synchrotron science in the United States. With its storage ring operating at 7 GeV electron energy, the experimental stations at APS offer a significantly higher flux of hard x-rays (above 20 keV), which are most suitable for high-pressure experiments, than other synchrotron sources in the country. APS beamlines are heavily utilized by members of the COMPRES community to carry out their research. APS is currently in the initial stage of a major midterm upgrade which will significantly boost the current capabilities and increase the amount of beam time available to users. This will be done by canting most of the existing insertion devices and creating new experimental stations. Since its inception, COMPRES has maintained its presence at APS by funding Infrastructure Development projects located at high-pressure beamlines (Sectors 3, 13, 16). Many of these projects have been very successful and have had a significant impact on the COMPRES community and their research output, as well as on the APS itself. COMPRES Technology Center (COMPTECH) at Argonne is established to realize the main mission to initiate, facilitate and coordinate new Partner User Proposals to create new capabilities and preferential access to state-of-the art facilities at existing beamlies at Advanced Photon Source for the COMPRES community. The location of the COMPTECH at the Argonne Laboratory brings several significant advantages: (i) as the most advanced hard X-ray synchrotron source in the country APS hosts a variety on unique, state of the art instruments and engages in development of novel forefront experimental technology (ii) ANL hosts several of the current COMPRES projects and there are on-going plans to establish more permanent COMPRES facilities though PUP proposals; (iii) ANL also hosts a lot of resident experts on experimental technology, software and methods development, as well as a whole spectrum of high-pressure researchers, who will be interested in collaborating with the COMPTECH, (iv) the lab is within driving distance from the COMPRES headquarters at Urbana and in close proximity to two major airports; (v) it is located at a central research facility frequently visited by the majority of active COMPRES members, which should allow and stimulate collaborations. People Program Director : Dr. Przemek Dera, E-mail: pdera@hawaii.edu Chief Technology Officer : Dr. Bin Chen, E-mail: binchen2@illinois.edu","tags":"pages","loc":"/pages/about.html","title":"About"},{"text":"Contact: Dr. Bin Chen COMPRES Technology Center (COMPTECH) 9700 S. Cass Ave, Bldg 438E Argonne, IL 60439 Tel: (1) 630 252-0893 E-mail: binchen2#illinois.edu (change # to @)","tags":"pages","loc":"/contact.html","title":"Contact Us"},{"text":"Databases JCPDS database , a collection of JCPDS files for X-ray Diffraction in this website . What is JCPDS card? American Mineralogist Crystal Structure Database RRUFF contains an integrated database of Raman spectra, X-ray diffraction and chemistry data for minerals. Mincryst Crystallographic Database for Minerals International Tables for Crystallography Volume A: Space-group symmetry contains extensive tabulations and illustrations of the 17 plane groups, the 230 space groups and the 32 crystallographic point groups.","tags":"tools","loc":"/tools/database.html","title":"Database"},{"text":"Tools Diamond anvil Raman pressure scale Reference diamond Raman peak (cm -1 ): Measured position (cm -1 ): Pressure = 0.0 GPa Calibration is from: Akahama Y. and Kawamura H., J. Appl. Phys. 100, 043516 (2006). /* Diamond pressure */ $(document).ready(function(){ $('[id^=dia_]').bind(\"keyup change\", function(){ diK = 547; diKp = 3.74; dia0 = parseFloat($('#dia_lambda0').val()); dia = parseFloat($('#dia_lambda').val()); diaP = (diK*(dia-dia0)/dia0)*(1 + 0.5*(diKp-1)*(dia-dia0)/dia0); $('#dia_pressure').text(diaP.toFixed(2) + \" GPa\"); }); });","tags":"tools","loc":"/tools/diamond.html","title":"Diamand anvil Raman pressure scale"},{"text":"Argonne National Laboratory Sector 3 ID-C PUP prjects: Tutorial for single crystal HERIX measurements .","tags":"facilities","loc":"/facilities","title":"Facilities"},{"text":"COMPRES Technology Center COMPRES, the Consortium for Materials Properties Research in Earth Sciences is a community-based consortium whose goal is to enable Earth Science researchers to conduct the next generation of high-pressure science on world-class equipment and facilities. It facilitates the operation of beam lines, the development of new technologies for high pressure research, and advocates for science and educational programs to the various funding agencies. COMPRES Technology Center (COMPTECH) is COMPRES's presence at the Advanced Photon Source, Argonne National Laboratory. New and Events Recent News and Events in the community Read More Facilities Information on COMPRES supported facilities Read More Software and Database Tools, software and database for high pressure research Read More","tags":"pages","loc":"/","title":"Homepage"},{"text":"A collection of common JCPDS files. If you have some JCPDS files to contribute, please contact Dr. Bin Chen (binchen2@illinois.edu). Click to download individual JCPDS card.","tags":"tools","loc":"/tools/jcpds/","title":"JCPDS cards"},{"text":"Beamline Facilities GeoSoilEnviroCARS HPCAT , High Pressure Collaborative Access Team at the Advanced Photon Source Professional Societies and Committtees in high-pressure science COMPRES website: Consortium for Materials Properties Research in Earth Sciences AIRAPT EHPRG Japan Society of High Pressure Science IUCr HP Commission American Geophysical Union","tags":"pages","loc":"/pages/links.html","title":"Links"},{"text":"Other Fluorescence pressure calculation and thermocouple tools ( by Dr. Innokenty Kantor ) Molar Mass Calculator for Chemists WebElements , Periodic Table of Elements","tags":"tools","loc":"/tools/other-tools.html","title":"Other Tools"},{"text":"Tools Ruby fluorescence pressure calculator Conditions: hydrostatic non-hydrostatic Reference ruby: nm, at T= (K) Measured ruby: nm, at T= (K) Pressure = 0.0 GPa Pressure dependence of ruby shift is from Mao H.K., Xu J., and Bell P.M. (1986) J. Geophys. Res. 91, 4673 Temperature correction is from Rekhi S., Dubrovinsky L.S., and Saxena S.K. (1999) High Temp. - High Pres. 31, 299 /* Ruby Scale */ $(document).ready(function(){ $('[id^=ruby_]').bind(\"keyup change\", function(){ A = 1904; k = 0.46299; l = 0.0060823; m = 0.0000010264; if ($('#ruby_cond').val() == \"hydro\") { B = 7.665; } else if ($('#ruby_cond').val() == \"nonhydro\") { B = 5; } reftemp = parseFloat($('#ruby_reftemp').val()); temp = parseFloat($('#ruby_temp').val()); lam0 = parseFloat($('#ruby_lambda0').val()); lam = parseFloat($('#ruby_lambda').val()); Acorr = A + k*(temp-reftemp); lam0corr = lam0 + l*(temp-reftemp) + m*((temp-reftemp)*(temp-reftemp)); rat = Math.pow(lam/lam0corr, B); P = (Acorr/B)*rat-(Acorr/B); $('#ruby_pressure').text(P.toFixed(2) + \" GPa\"); }); });","tags":"tools","loc":"/tools/ruby.html","title":"Ruby fluorescence pressure calculator"},{"text":"X-ray diffraction and high pressure research softwares XRD Data Analysis and Interpretation FIT2D , a general purpose and specialist 1 and 2 dimensional data analysis program. ( by A. Hammersley ) Manual Download , available for Mac, Linux, and Windows BEARTEX , the Berkeley Texture Package, provides a set of over 35 programs running under Windows environment to analyze preferred orientation in polycrystalline materials (by Ruby Wenk ). Maud , Materials Analysis Using Diffraction. It is a general diffraction/reflectivity analysis program mainly based on the Rietveld method, but not limited to. CrystalSleuth is capable of analyzing and manipulating both Raman and powder diffraction data sets. XtalDraw is interactive Windows-based software that draws crystal and molecular structures as ball and stick, polyhedral, and thermal ellipsoid representations. HPDiff simulates composite diffraction patterns of materials under high pressure. GSE_ADA/RSV , single crystal x-ray diffraction package ( by Przemek Dera ) GSE_shell , is a GUI (Graphical User Interface) driven program developed at GeoSoilEnviro CARS to help researchers collecting x-ray diffraction data at the synchrotron in quick preliminary evaluation and simple analysis of their experimental results. ( by Przemek Dera ) FitEoS , can be used to fit compression data with various equation of states. ( by Lili Gao ) PressureScale can be used to calculate pressure from equation of state. ( by Lili Gao ) GSAS-2 VESTA , structure visualization and electron density modeling University of Bari crystallographic software , structure solution and refinement for powder and single crystal ShelX , crystal structure refinement PowderCell , for powder diffraction, great for group-subgroup relation analysis Powder3d , very useful program for powder analysis and Refinement WinGX , shell for single crystal crystallographic analysis Fox , structure solution from powder diffraction Fullprof , alternative to GSAS DiffPy , great tools for pair distribution function analysis Fable , multigrain single-crystal analysis Rietan , pattern fitting and Rietveld refinement USPEX , is a method developed jointly by Artem R. Oganov, Andriy O. Lyakhov, Colin W. Glass and Qiang Zhu, and implemented in the same-name code written by Andriy O. Lyakhov, Colin W. Glass and Qiang Zhu. This method/code enables crystal structure prediction at arbitrary P-T conditions, given just the chemical composition of the material. CrystalCracker ( by Kurt Leinenweber ) Ross Angel's softwares FitYK , peak fitting program. Pressure determination Ruby fluorescence pressure calculator {:target=\" blank\"} (_by Bin Chen ) Diamond anvil Raman pressure scale {:target=\" blank\"} (_by Bin Chen )","tags":"tools","loc":"/tools/software.html","title":"Software"},{"text":"","tags":"tools","loc":"/tools","title":"Tools"},{"text":"Introduction To be added. Instruments To be added. Procedures Alignment To be added","tags":"facilities","loc":"/facilities/herix.html","title":"Tutorial for Single crystal HERIX measurements"},{"text":"Drs. Przemyslaw Dera and Bin Chen attended the EarthCube workshop on November 12-14, 2013 in Alexadria, VA. The 2.5-day workshop addressed the current state and future directions of cyberinfrastructure development in support of rock deformation and high pressure mineral physics research via the COMPRES and the DEFORM communitiies. The central goals of the workshop were to facilitate scientific discovery via cyberinfrastructure development and to identify EarthCube activities that promote research in high-pressure mineral physics and rock deformation.","tags":"news","loc":"/news/2013/Nov-12-earthcube-workshop.html","title":"EarthCube workshop"},{"text":"Ruby pressure scale and Diamond Anvil pressure calculator have been added to the tools section of the website. These two tools are written and maintained by Bin Chen (binchen2@illinois.edu). Also, a JCPDS database is created. If you have any files to contribute, please contact Bin Chen (binchen2@illinois.edu). Thank you!","tags":"news","loc":"/news/2013/Apr-10-added-ruby-and-diamand-anvil-pressure-scale-and-jcpds-database.html","title":"Added Ruby and diamand anvil pressure scale and JCPDS database"},{"text":"COMPTECH website is online.","tags":"news","loc":"/news/2013/Apr-01-hello-world.html","title":"Hello World"}]}