{"pages":[{"text":"About COMPRES COMPRES , the Consortium for Materials Properties Research in Earth Sciences is a community-based consortium whose goal is to enable Earth Science researchers to conduct the next generation of high-pressure science on world-class equipment and facilities. It facilitates the operation of beam lines, the development of new technologies for high pressure research, and advocates for science and educational programs to the various funding agencies. About COMPTECH The mission of COMPRES is driven by its science goals, but it is mainly the experimental technology available at central facilities such as synchrotron beamlines, that enables this science. Argonne National Laboratory's synchrotron source, the Advanced Photon Source (APS) is currently the leading central facility for synchrotron science in the United States. With its storage ring operating at 7 GeV electron energy, the experimental stations at APS offer a significantly higher flux of hard x-rays (above 20 keV), which are most suitable for high-pressure experiments, than other synchrotron sources in the country. APS beamlines are heavily utilized by members of the COMPRES community to carry out their research. APS is currently in the initial stage of a major midterm upgrade which will significantly boost the current capabilities and increase the amount of beam time available to users. This will be done by canting most of the existing insertion devices and creating new experimental stations. Since its inception, COMPRES has maintained its presence at APS by funding Infrastructure Development projects located at high-pressure beamlines (Sectors 3, 13, 16). Many of these projects have been very successful and have had a significant impact on the COMPRES community and their research output, as well as on the APS itself. COMPRES Technology Center (COMPTECH) at Argonne is established to realize the main mission to initiate, facilitate and coordinate new Partner User Proposals to create new capabilities and preferential access to state-of-the art facilities at existing beamlies at Advanced Photon Source for the COMPRES community. The location of the COMPTECH at the Argonne Laboratory brings several significant advantages: (i) as the most advanced hard X-ray synchrotron source in the country APS hosts a variety on unique, state of the art instruments and engages in development of novel forefront experimental technology (ii) ANL hosts several of the current COMPRES projects and there are on-going plans to establish more permanent COMPRES facilities though PUP proposals; (iii) ANL also hosts a lot of resident experts on experimental technology, software and methods development, as well as a whole spectrum of high-pressure researchers, who will be interested in collaborating with the COMPTECH, (iv) the lab is within driving distance from the COMPRES headquarters at Urbana and in close proximity to two major airports; (v) it is located at a central research facility frequently visited by the majority of active COMPRES members, which should allow and stimulate collaborations. People Program Director : Dr. Przemek Dera, E-mail: pdera@hawaii.edu Chief Technology Officer : Dr. Bin Chen, E-mail: binchen@hawaii.edu","tags":"pages","loc":"/pages/about.html","title":"About"},{"text":"ATREX - integrated open source data analysis software for mineral and environmental sciences ATREX (Advanced Tools for Research in Extreme Xtallography). Principal investigators: PI: Przemyslaw Dera (University of Hawaii) Co-PI: Bin Chen (University of Hawaii), Lars Ehm (Stony Brook University) GitHub repository : source code and software distributions. Project summary Synchrotron radiation user facilities are critical resources, which enable state of the art research and training in mineralogy, mineral physics and environmental science. Access to these facilities is very competitive (science-merit-based peer review process), and time allocated for experiments always very constrained. The most popular and fundamental type of experiments conducted at synchrotrons is X-ray diffraction, which produces information about the details of the crystal structure, symmetry, chemical bonding and density of minerals and other crystalline solids. Depending on the form of the sample, diffraction experiments can be conducted with single crystals, multiple crystals (e.g. very coarse powder), bulk powders, nano-powders and glasses. Modern synchrotron-based diffraction experiments are typically conducted with the use of area detectors, in which case the data is recorded as digital diffraction images. Conventional diffraction experiments (carried out at ambient conditions with good quality samples, typically of only one crystalline phase) usually produce data that can be analyzed with a combination of the currently available software. However, the situation is much more difficult with unconventional data, e.g. produced during experiments at non-ambient conditions, involving samples embedded in thin sections, or exploring the real time progress of chemical or physical processes. The unconventional experiments are extremely valuable in lab-scale modeling of technological (e.g. CO2 sequestration, new hydrogen storage material discovery, gas separation), as well as geological processes (e.g. deformation and phase transitions of mantle minerals), but introduce significant complexities into the data, often beyond the capabilities of available analysis software. Technology used in synchrotron experiments evolves rapidly increasing the speed of the data collection and producing massive volumes of experimental data, posing new serious challenges for data analysis, particularly for unconventional experiments. The experiments are often decision-driven, and require at least partial real time data interpretation to provide the experimenter with the necessary information on how to proceed (e.g. monitoring a progress of sample transformation, or detecting a subtle discontinuity which may require a more careful investigation). Software offering such real time analysis capabilities is currently not available. Utilizing a combination of existing, well tested and widely used software components developed in the Interactive Data Language by the PI Dera, Python code developed by the co-PI Ehm at the Brookhaven National Lab and Bayesian statistics Matlab code by Project Collaborator Wolf at the University of Michigan we propose to create a new integrated multiplatform, open-source Python software package ATREX (Advanced Tools for Research in Extreme Xtallography), with unique capabilities to process diffraction image data from samples in all forms from glasses and melts, bulk powders, though coarse multi grains, to single crystals, which will support new data types produced by novel ultrafast X-ray imaging detectors, offer extensive automated serial processing capabilities for massive data sets and will allow real time data analysis for time-constrained decision-driven synchrotron experiments. ATREX will include database access capabilities utilizing the free American Mineralogist Crystal Structure Database. The Intellectual Merits of this project focus on unique combination of novel tools for diffraction-based synchrotron research in Earth and environmental sciences including: (IM1) New capabilities for structure determination of unknown phases and identification of known phases in natural and synthetic samples; (IM2) Opening new possibilities for real time analysis in studies of solid state dynamic processes; (IM3) Robust Bayesian analysis of outliers, uncertainties and missing data; and (IM4) Creation of new free advanced tools for utilizing the available mineralogical database in synchrotron research. The Broader impacts of the proposed activities will include (BI1) easy accessibility of the new tools, which will be deployed and distributed through the open source code repository site github, as well as through all major synchrotron facilities for Earth science where novel types of experiments are carried out; (BI2) training opportunities, both utilizing online guides and tutorials, as well as workshops; (BI3) open source availability of the software components encouraging collaborations with other developers; (BI4) attractiveness of the ATREX tools outside Earth science community, e.g. in chemistry, materials science and engineering, as well as condensed matter physics.","tags":"pages","loc":"/atrex/index.html","title":"ATREX"},{"text":"Contact: Dr. Bin Chen COMPRES Technology Center (COMPTECH) 9700 S. Cass Ave, Bldg 438E Argonne, IL 60439 Tel: +1 (808)-956-6908 E-mail: binchen#hawaii.edu (change # to @)","tags":"pages","loc":"/contact.html","title":"Contact Us"},{"text":"Databases JCPDS database , a collection of JCPDS files for X-ray Diffraction in this website . What is a JCPDS card? American Mineralogist Crystal Structure Database RRUFF contains an integrated database of Raman spectra, X-ray diffraction and chemistry data for minerals. Mincryst Crystallographic Database for Minerals International Tables for Crystallography Volume A: Space-group symmetry contains extensive tabulations and illustrations of the 17 plane groups, the 230 space groups and the 32 crystallographic point groups.","tags":"tools","loc":"/tools/database.html","title":"Database"},{"text":"Tools Diamond anvil Raman pressure scale Reference diamond Raman peak (cm -1 ): Measured position (cm -1 ): Pressure = 0.0 GPa Calibration is from: Akahama Y. and Kawamura H., J. Appl. Phys. 100, 043516 (2006). /* Diamond pressure */ $(document).ready(function(){ $('[id^=dia_]').bind(\"keyup change\", function(){ diK = 547; diKp = 3.74; dia0 = parseFloat($('#dia_lambda0').val()); dia = parseFloat($('#dia_lambda').val()); diaP = (diK*(dia-dia0)/dia0)*(1 + 0.5*(diKp-1)*(dia-dia0)/dia0); $('#dia_pressure').text(diaP.toFixed(2) + \" GPa\"); }); });","tags":"tools","loc":"/tools/diamond.html","title":"Diamand anvil Raman pressure scale"},{"text":"Advanced Photon Source, Argonne National Laboratory Sector 3 ID-C Tutorial: single crystal HERIX measurements . Sector 13 BM-C Information on 13 BM-C GSECARS/COMPRES gas loading system Contact: Sergey Tkachev (Email: tkachev@cars.uchicago.edu) Beamline Scientist, High Pressure / High Temperature Diamond Anvil Cell (DAC) Main Contact : GSECARS / COMPRES Gas Loading System GSECARS, University of Chicago Building 434A, Argonne National Laboratory 9700 South Cass Ave. Argonne, IL 60439 Phone : 630.252.0430 Fax : 630.252.0436","tags":"facilities","loc":"/facilities","title":"Facilities"},{"text":"COMPRES Technology Center COMPRES, the Consortium for Materials Properties Research in Earth Sciences is a community-based consortium whose goal is to enable Earth Science researchers to conduct the next generation of high-pressure science on world-class equipment and facilities. It facilitates the operation of beam lines, the development of new technologies for high pressure research, and advocates for science and educational programs to the various funding agencies. COMPRES Technology Center (COMPTECH) is COMPRES's presence at the Advanced Photon Source, Argonne National Laboratory. New and Events Recent News and Events in the community Read More Facilities Information on COMPRES supported facilities Read More Software and Database Tools, software and database for high pressure research Read More","tags":"pages","loc":"/","title":"Homepage"},{"text":"13-BMC at GSECARS Recent Progress Clean-up slits design Introduction TBA Gallery TBA","tags":"facilities","loc":"/facilities/13BMC.html","title":"Information on 13BMC"},{"text":"JCPDS database A collection of common JCPDS files. If you have some JCPDS files to contribute, please contact Bin Chen (binchen2@illinois.edu). Click to download individual JCPDS card .","tags":"tools","loc":"/tools/jcpds/","title":"JCPDS cards"},{"text":"Beamline Facilities GeoSoilEnviroCARS HPCAT , High Pressure Collaborative Access Team at the Advanced Photon Source Professional Societies and Committtees in high-pressure science COMPRES website: Consortium for Materials Properties Research in Earth Sciences AIRAPT EHPRG Japan Society of High Pressure Science IUCr HP Commission American Geophysical Union","tags":"pages","loc":"/pages/links.html","title":"Links"},{"text":"Other Fluorescence pressure calculation and thermocouple tools ( by Dr. Innokenty Kantor ) Molar Mass Calculator for Chemists WebElements , Periodic Table of Elements","tags":"tools","loc":"/tools/other-tools.html","title":"Other Tools"},{"text":"Tools Ruby fluorescence pressure calculator Conditions: hydrostatic non-hydrostatic Reference ruby: nm, at T= (K) Measured ruby: nm, at T= (K) Pressure = 0.0 GPa Pressure dependence of ruby shift is from Mao H.K., Xu J., and Bell P.M. (1986) J. Geophys. Res. 91, 4673 Temperature correction is from Rekhi S., Dubrovinsky L.S., and Saxena S.K. (1999) High Temp. - High Pres. 31, 299 /* Ruby Scale */ $(document).ready(function(){ $('[id^=ruby_]').bind(\"keyup change\", function(){ A = 1904; k = 0.46299; l = 0.0060823; m = 0.0000010264; if ($('#ruby_cond').val() == \"hydro\") { B = 7.665; } else if ($('#ruby_cond').val() == \"nonhydro\") { B = 5; } reftemp = parseFloat($('#ruby_reftemp').val()); temp = parseFloat($('#ruby_temp').val()); lam0 = parseFloat($('#ruby_lambda0').val()); lam = parseFloat($('#ruby_lambda').val()); Acorr = A + k*(temp-reftemp); lam0corr = lam0 + l*(temp-reftemp) + m*((temp-reftemp)*(temp-reftemp)); rat = Math.pow(lam/lam0corr, B); P = (Acorr/B)*rat-(Acorr/B); $('#ruby_pressure').text(P.toFixed(2) + \" GPa\"); }); });","tags":"tools","loc":"/tools/ruby.html","title":"Ruby fluorescence pressure calculator"},{"text":"X-ray diffraction and high pressure research softwares XRD Data Analysis and Interpretation FIT2D , a general purpose and specialist 1 and 2 dimensional data analysis program. ( by A. Hammersley ) Manual Download , available for Mac, Linux, and Windows BEARTEX , the Berkeley Texture Package, provides a set of over 35 programs running under Windows environment to analyze preferred orientation in polycrystalline materials (by Ruby Wenk ). Maud , Materials Analysis Using Diffraction. It is a general diffraction/reflectivity analysis program mainly based on the Rietveld method, but not limited to. CrystalSleuth is capable of analyzing and manipulating both Raman and powder diffraction data sets. XtalDraw is interactive Windows-based software that draws crystal and molecular structures as ball and stick, polyhedral, and thermal ellipsoid representations. HPDiff simulates composite diffraction patterns of materials under high pressure. GSE_ADA/RSV , single crystal x-ray diffraction package ( by Przemek Dera ) GSE_shell , is a GUI (Graphical User Interface) driven program developed at GeoSoilEnviro CARS to help researchers collecting x-ray diffraction data at the synchrotron in quick preliminary evaluation and simple analysis of their experimental results. ( by Przemek Dera ) FitEoS , can be used to fit compression data with various equation of states. ( by Lili Gao ) PressureScale can be used to calculate pressure from equation of state. ( by Lili Gao ) GSAS-2 VESTA , structure visualization and electron density modeling University of Bari crystallographic software , structure solution and refinement for powder and single crystal ShelX , crystal structure refinement PowderCell , for powder diffraction, great for group-subgroup relation analysis Powder3d , very useful program for powder analysis and Refinement WinGX , shell for single crystal crystallographic analysis Fox , structure solution from powder diffraction Fullprof , alternative to GSAS DiffPy , great tools for pair distribution function analysis Fable , multigrain single-crystal analysis Rietan , pattern fitting and Rietveld refinement USPEX , is a method developed jointly by Artem R. Oganov, Andriy O. Lyakhov, Colin W. Glass and Qiang Zhu, and implemented in the same-name code written by Andriy O. Lyakhov, Colin W. Glass and Qiang Zhu. This method/code enables crystal structure prediction at arbitrary P-T conditions, given just the chemical composition of the material. CrystalCracker ( by Kurt Leinenweber ) Ross Angel's softwares FitYK , peak fitting program. MINUTI : A scientific application for: calculation and fitting of experimental p-V-T data to a thermal and/or spin equation of state; calculation of sound velocities including spatial averages from elastic constants; calculation and fitting of melting spectra from nuclear resonant forward scattering. ( by Wolfgang Sturhahn ) Pressure determination Ruby fluorescence pressure calculator {:target=\" blank\"} (_by Bin Chen ) Diamond anvil Raman pressure scale {:target=\" blank\"} (_by Bin Chen ) Spectroscopic data processing PHOENIX : A scientific application to manipulate experimental data obtained using the nuclear resonant inelastic x-ray scattering technique ( by Wolfgang Sturhahn ) CONUSS : A scientific application to calculate nuclear resonant scattering spectra and fit relevant parameters to experimental data obtained using synchrotron Mössbauer spectroscopy, conventional Mössbauer spectroscopy, nuclear forward scattering, nuclear Bragg/Laue scattering, and grazing incidence nuclear resonant scattering. ( by Wolfgang Sturhahn )","tags":"tools","loc":"/tools/software.html","title":"Software"},{"text":"Popular tools and database (by COMPTECH) JCPDS database - Ruby pressure calculator - Diamond anvil Raman pressure calculator","tags":"tools","loc":"/tools","title":"Tools"},{"text":"GETTING ORIENTATION MATRIX FOR SINGLE CRYSTALS USING GSA-ADA Ver. 1 October 2013 1. Introduction: This manual describes a procedure for finding orientation matrix (UB matrix) for single crystal. Data is collected from Perkin Elmer (PE) flat panel 2D detector. PE detector control can be opened by clicking \" _epics \" icon that runs the epics * as well. GSA-ADA is witten in IDL code. There are three stages for obtaining UB matrix: Collecting data usi_DC units,, Analyzing data wih GSA-ADA Extracting orientation matrix by RSV utility. 1. Collecting data: First open IDL 6.4 version. GSA-ADA and its utilities works with version and not with version 8.0. Sele_DC.prj under FileRecent ProectsC:3_DC.prj . Compile al files under ProjectCompileAll Files twice. And run project under Project Run . This will bring two new windows _DC and CCD Image**). _DC winow, by clicking \" EPICS Config \" on the upper right corner connect to EPICS configuration for controlling and recording motor positions. It brings another window named EPICS Configuration . If the motor names have not been changed, there is nothing to do for the fields. Make sure motor names are correct. Then click \"CONNECT\" bottom on the lower side. Program will be ready when EPICS Configuration window closes itself and shows Connected message in the EPICS Connection field in the main_DC window. This might take up to a mi Program collects data from defined positions of the translational stages and one can define up to five different samples placed on the stage. Depending on how many samples you have, one can enter those positions by moving XYZ translational stages to specific sample. Currently Kohzu X (m50), Kohzu Y (m51) and Kohzu Z (m52) set as sample translational sta - Click on \"define\" bottom. It will read the position of the sample X, Y, Z . - To collect data from this sample position, check the field says \"collect\" . - Collection of the data is done by rotating Phi circle. In order to do this, check and write the range of rotation you would like to do in the fields. It is given as start (at -15 degree), total range (30 degree), number of steps (30) and exp. Time per deg. (1 sec). This will do phi rotation of -15 to +15 degree in 30 steps with 1 sec exposure time and it will only take about 30 seconds. Also define name and directory where the files will be saved. This can be done by selecting directory name in field on the top left side called \"NTFS dir\" . WriteUs_AUG13\" and \"sample name\" li_D1. Define star #\" like 001.* Finally check ‘start Exposure\" to collect data. Make sure to open station shutter before collecting data. Currently it is not connected to shutters . Program moves the motor to position. For this starts speed of zero. Then motor moves ahead of the position (like to -15.5). Then starts recording at -15 degree. NOW Data is collected. One can make sure whether data is collected or not by going into directory where data is saved. Once data is collected, we will move to next step by using one of the two programs (GSA-ADA and RSV) fi 2. Analyzing data with GSA-ADA: One can open this program by clicking GSA-ADA.sav file that is in the folder in desktop. It popups a new window named \"Image format and size\" where we define the image format. For PE detector, it TIFF an size 1024x1024 pixel . Therefore select \"Tiff\" and correct size here. Then, hit \"start\" . It opens another window named \"GSA-ADA.ver1.6 September 7 2012\" . In this program, open one of the file in the directory where data collected by selecting FileOpen . Check the orientation of the image by looking at the beam stop shadow where it is pointing. Image at 3ID-C PE detector is 90 degree rotated to reference and beam stop should be seen in the horizontal plane pointing right to left. In reality it should point vertical from bottom to top. For 3ID-C PE detector select \"Invert X, Invert Y, and Transpose\" all three on the upper right side of the window to bring orientation to what GSE-ADA can process (that is beam stop from pointing down) Then reopen one of the images again. Now one can sees that beam stop shadow is rotated vertically and shown from bottom. Then go to \"SCAN\" in the menu bar and click \"Merge step images\" bottom on the lower right side. Program goes through all images to merge them. One can change the range of colors for easy view of weak peaks say from 100010000. At this point, one should make sure that proper calibration values are obtained and ready for use. This is under main menu named \"Calibration\". Calibration files are created by diffraction image from standard CeO2 powder. This data should be taken before the sample images or usually there should be calibration file named \"cal.cal\" already taken before. Unless detector position did not changed or detector is not removed, this will not change and one can use this file. One can open this file under \"Calibration\", Open and opening correct xxx.cal file. One can check calibration and so on by selecting \"Show rings\" in the lower right side of the window. After this action, calibration rings will be overlaid on the image. Check whether everything is fine, If there is a problem like same set of two theta points show themselves on the opposite side of the CeO2 rings. Then just do the calibration again. Creating Calibration file using standard powder sample, Go to FileOpen and find calibration file. Change signal to noise ratio to smaller number. This is the field under \"TEST\" button on the lower right side of the \"Calibration\" window (like to value 1.1) Then check \"Refine cal\" next to \"TEST\" button. It takes about 30 second. After it is done, it gives result with standard deviations. Check this result, If it is okay, Then save the calibration file as \"xxx .cal\" file. Open again one of the collected data and merge again. Verify calibration as well. Peak search, Select \"SEARCH\" window next to File menu for peak search in the image. Even though, one can select diffraction peaks by hand, GSA-ADA program can find diffraction peaks automatically. This can be done by Clicking \" PS button\". Make sure output directory is same as the directory that you read the images. By clicking PS button, program starts searching merged image file and shows progress in new pop up window. If program returns with results that are not realistic like many more boxes than the existing peaks or half of the screen is full with boxes but the other half is empty vs., change Threshold (say 1.051.1. Then go to \"PEAKS\" window and click \"CLEAR\" button. Later go back to \"SEARCH\" window and change \"minI\" from 10 to 100 and \"PS search\" again. Remember Threshold and min I important values to change. At the end, program finds most of the peaks. Some might not be found or some of them might be wrong. In the program, there is an option to add or remove peaks manually. In order to use this feature, drag mouse in to image and perform right click. It will bring drop menu and select \"ADD peak\" . Unfortunately, one can add one peak at a time. Then drag mouse over the peak. Peak will be highlighted by a box. Perform this until you add all the peaks. One can also remove unwanted peaks in the program by clicking right mouse and selecting \"Select\" . Then select the boxes that are going to be removed with clicking left mouse and dragging mouse over the boxes/region and clicking left mouse again. In this way, one selects the unwanted peaks for removing purposes. Then click \"DELETE\" button on the right top side of the PEAK menu. You can turn of selection by clicking right mouse in the image window by selecting \"SELECTION OFF\" . Note, this peak search routine creates a file named \"a.pks\" after performing search. Now peak selection is done and ready for fitting. Before performing fitting, one can check the diffraction peaks and selection of boxes around these peaks for the last time. Fitting is done in boxes and box size is measured in pixels. The number in the field \"box\" is radius of the box. Change box size from 20 to 10 since 20 is too big (box size 10 means, box is chosen 10 pixels on the left and right side). Click \"Change size\" just underneath. There are for windows with three of them are in black color and one of them (lower right corner) has information regarding peaks. One can check the individual peaks by selecting one of them and scrolling down of each. These three windows show the magnified image of the diffraction peaks and once scrolled, main image window shows selected peak box with green color. Therefore, one can check the quality of the peak this way. Keep scrolling to different peaks; if diffraction is just one pixel, you can delete it by clicking \"delete\" on the top left side in PEAK menu. Also if it gives some error message remove that point as well. After surveying and removing unwanted peaks, then save file into same file by clicking to \"SAVE\" and this will popup save window. Save to same file as named \"a.pks\". Now, we have pixel coordinate of the peaks we find and we need to know the angles at which the peak had max intensity. Therefore, this is one of the important steps. For this step, go to \"SCAN\" window and tell the program how the scan was done. We did our scan \"START\" at -15 degree with \"STEP\" of 1. (When we open the first image at the beginning, the program already found out that we have\" number Images\" 30 with \"Start no\" 1.) After checking all these fields, make sure everything is okay, then click \"COMPUT> FROM SCAN\" button. This opens the images in sequence of how intensity varied. It gives message that profile computation is successfully completed. When it is done program gives output (that is in the peak menu) of angles in the column last to second. After we finished analyzing steps, we have to save the file again in a.pks file. 3. Extracting orientation matrix by RSV utility. Now that we determine the pixel coordinate of the peak as well as the angles associated with those peaks, we are ready for calculating and refining the lattice parameters and orientation matrix of the single crystal. For this, we will use second program called RSV. - Open a.pks file under FILE Open. - In the view window, program shows the projection of the reciprocal space along the x-ray direction of the each of the diffraction peaks that we used. We can change the scaling and rotation of the viewing angle to investigate the profile. - This rotation can be done by selecting \"HAND ROTATION\" . It rotates the reciprocal space image around and one can look for how these diffraction points are aligned along a line. In good fitting diffraction points should perfectly align to lines. Then we should be able to index it. Next go to \"INDEX\" and \"TRANSFORM\" . There is an external program called \"CELLNOW\" . Click this and it says current peak table has been saved in the file named \"xxx.php\" . Say OK. This the way it passes the information to cellnow . Save it in an input file that has extension .p4p Pops up new window. First thing CELLNOW ask in cell-now.exe window is the name of the file type xxx.p4p Then, it asks some questions, hit enter until program ask min and max values allowed cell edges. 2-10 is fine. Hit enter again. CELLNOW program comes with possible solutions. Select the solution that you want. Then it asks a name for output file like \"1.p4p\". The default directory for this file i_m** You can read this calcultd orientation matrix in the main program by going to \"INDEX\"\"FILE\" and click on \"READ from p4p\" in the directory specif_m1.p4p . After we open this file, program displays the lattice parameters that contain the file. There is a button named \"SELECT w/UB\" , if we click it, we can see colors of each point changes. Calculated values are off from integer number about 0.1, it is selected with darker color and not indexable. Go to View and click Delete selected to remove them. Go to REFINE and impose the symmetry constrain like tetragonal. Then click REFINE w/d space and it shows hkl values. One can check under FILTER distributions of error for difference of d-spacing calculated for each peak from the hkl orientation matrix versus what was measured. Some of the outliers might be big. We have orientation matrix that we should share. Under INDEX FILE, SAVE in UB format called **amb.U Go back to GSE-ADA program and PREDICTSIMULATE opens new window called diffraction image simulation/ manual. Indexing Lets merge the image again to see all the peaks under SCANMERGE STEP Image. Then in extra window, click OPEN and and open \"amb.UB\" file There is an opening angle of DAC (select this angle, if no DAC use say 180 degree) Then click \"GENERATE\" should calculate where peaks should be. In program, there is a virtual goniometer that one can simulate what will happen or how much Chi angle should be ratated to bring desired peak to horizontal axis so on. Select Chi angle in say 5degree step and then click chi. This might be very useful tool to see.","tags":"facilities","loc":"/facilities/herix.html","title":"Tutorial for Single crystal HERIX measurements"},{"text":"The AGU fall meeting in San Francisco was held from December 9 to 14. Dr. Bin Chen presented his work on \"Sound velocities of Fe 7 C 3 \" at 9 am on Monday.","tags":"news","loc":"/news/2013/Dec-09-agu-meeting.html","title":"AGU meeting"},{"text":"Drs. Przemyslaw Dera and Bin Chen attended the EarthCube workshop on November 12-14, 2013 in Alexadria, VA. The 2.5-day workshop addressed the current state and future directions of cyberinfrastructure development in support of rock deformation and high pressure mineral physics research via the COMPRES and the DEFORM communitiies. The central goals of the workshop were to facilitate scientific discovery via cyberinfrastructure development and to identify EarthCube activities that promote research in high-pressure mineral physics and rock deformation.","tags":"news","loc":"/news/2013/Nov-12-earthcube-workshop.html","title":"EarthCube workshop"},{"text":"2013 COMPRES annual meeting was held in Lake Geneva, Wisconsin, June 17-20, 2013. Dr. Bin Chen gave a presentation on \"COMPRES Technology Center\".","tags":"news","loc":"/news/2013/Jun-17-compres-annual-meeting.html","title":"COMPRES annual meeting"},{"text":"Ruby pressure scale and Diamond Anvil pressure calculator have been added to the tools section of the website. These two tools are written and maintained by Bin Chen ( binchen2@illinois.edu binchen@hawaii.edu). Also, a JCPDS database is created. If you have any files to contribute, please contact Bin Chen ( binchen@illinois.edu binchen@hawaii.edu). Thank you!","tags":"news","loc":"/news/2013/Apr-10-added-ruby-and-diamand-anvil-pressure-scale-and-jcpds-database.html","title":"Added Ruby and diamand anvil pressure scale and JCPDS database"},{"text":"COMPTECH website is online.","tags":"news","loc":"/news/2013/Apr-01-hello-world.html","title":"Hello World"}]}